lmtan91/Ublox_Gnss_Stm32/VektorControlUnit_V2.ioc
#MicroXplorer Configuration settings - do not modify
NVIC.CAN1_RX1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
CAN1.NART=ENABLE
PC7.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
USART2.IPParameters=VirtualMode
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.VirtualType=VM_MASTER
FATFS._USE_LFN=1
PE11.GPIOParameters=GPIO_Label
SPI1.VirtualType=VM_MASTER
TIM1.IPParameters=Prescaler,Period
RCC.PLLCLKFreq_Value=72000000
PC12.Signal=UART5_TX
PC7.Locked=true
PD3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=SD_MISO
PD10.GPIO_PuPd=GPIO_PULLDOWN
PD0.Locked=true
PD4.Locked=true
USART1.IPParameters=VirtualMode
PD6.GPIO_Label=SD_CS
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD7.GPIO_PuPd=GPIO_PULLDOWN
NVIC.CAN1_TX_IRQn=true\:0\:0\:false\:false\:true\:true\:true
SPI1.Direction=SPI_DIRECTION_2LINES
TIM2.IPParameters=Prescaler,Period
PD4.Signal=GPIO_Output
RCC.APB2TimFreq_Value=72000000
PC7.Signal=GPIO_Output
SPI1.CalculateBaudRate=9.0 MBits/s
PD0.Signal=GPIO_Output
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
PE5.Signal=GPIO_Output
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Full_Duplex_Master
PD1.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
PD1.GPIO_Label=LED_R2
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.3
MxDb.Version=DB.6.0.21
PE15.Locked=true
PE0.GPIOParameters=PinState,GPIO_Label
ProjectManager.BackupPrevious=false
PE9.Signal=GPIO_Output
PE9.Locked=true
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PE4.GPIO_Label=LED_B3
PB8.PinState=GPIO_PIN_SET
PE2.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
VP_TIM1_VS_ClockSourceINT.Mode=Internal
PC8.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
Mcu.Package=LQFP100
PB9.Signal=GPIO_Output
TIM2.Prescaler=11
PD0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
RCC.I2S2Freq_Value=72000000
SPI3.Mode=SPI_MODE_MASTER
PD5.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
PA5.GPIOParameters=GPIO_Label
PC11.Mode=Asynchronous
RCC.APB1TimFreq_Value=72000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
UART5.BaudRate=115200
TIM1.Period=500
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PD5.Locked=true
CAN1.CalculateTimeBit=3999.99
ProjectManager.CustomerFirmwarePackage=
CAN1.CalculateTimeQuantum=444.44444444444446
NVIC.UART4_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA5.Mode=Full_Duplex_Master
PA6.GPIOParameters=GPIO_Label
PD6.GPIOParameters=GPIO_Label
RCC.PLL3VCOoutputFreqValue=128000000
ProjectManager.ProjectFileName=VektorControlUnit_V2.ioc
PA15.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
Mcu.PinsNb=52
CAN1.IPParameters=CalculateTimeQuantum,CalculateTimeBit,BS1,AWUM,NART,BS2,CalculateBaudRate
PD3.Signal=GPIO_Output
CAN1.CalculateBaudRate=250000
PC9.PinState=GPIO_PIN_SET
PD13.GPIOParameters=GPIO_PuPd,GPIO_Label
PD7.Signal=GPIO_Output
PD1.Signal=GPIO_Output
SPI1.CLKPhase=SPI_PHASE_2EDGE
PD1.GPIO_PuPd=GPIO_PULLDOWN
UART5.VirtualMode=Asynchronous
RCC.APB1CLKDivider=RCC_HCLK_DIV2
UART4.VirtualMode=Asynchronous
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.I2S3Freq_Value=72000000
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PD10.Signal=GPIO_Output
PA3.Mode=Asynchronous
PD4.PinState=GPIO_PIN_SET
PB8.GPIO_Label=EEPROM_WP
PA15.Locked=true
Mcu.Pin51=VP_TIM6_VS_ClockSourceINT
Mcu.Pin50=VP_TIM2_VS_ClockSourceINT
PA9.Signal=USART1_TX
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
PB9.Locked=true
OSC_IN.Signal=RCC_OSC_IN
PC7.GPIO_PuPd=GPIO_PULLDOWN
PD7.Locked=true
PE9.GPIO_Label=EXT-ANT
Mcu.Pin48=VP_SYS_VS_Systick
Mcu.Pin49=VP_TIM1_VS_ClockSourceINT
Mcu.Pin46=PE0
Mcu.Pin47=VP_FATFS_VS_Generic
PE2.GPIO_PuPd=GPIO_PULLDOWN
PA5.Signal=SPI1_SCK
PD7.PinState=GPIO_PIN_SET
Mcu.Pin40=PD7
Mcu.Pin41=PB3
PE13.GPIOParameters=GPIO_Label
PC12.Mode=Asynchronous
Mcu.Pin44=PB8
Mcu.Pin45=PB9
Mcu.Pin42=PB4
Mcu.Pin43=PB5
ProjectManager.LastFirmware=true
PE15.Signal=GPIO_Output
Mcu.Pin37=PD4
Mcu.Pin38=PD5
Mcu.Pin35=PD2
PB15.GPIO_Label=BLE_LINKS_CMD_MLDP
Mcu.Pin36=PD3
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PD6
Mcu.Pin30=PC10
PC9.GPIO_PuPd=GPIO_PULLDOWN
Mcu.Pin33=PD0
Mcu.Pin34=PD1
Mcu.Pin31=PC11
Mcu.Pin32=PC12
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=59999
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
PC9.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
Mcu.Pin26=PA12
Mcu.Pin27=PA13
Mcu.Pin24=PA10
ProjectManager.UnderRoot=true
PE4.GPIO_PuPd=GPIO_PULLDOWN
PE13.Locked=true
Mcu.Pin25=PA11
Mcu.Pin28=PA14
PC7.GPIO_Label=LED_G1
Mcu.Pin29=PA15
PC8.GPIO_PuPd=GPIO_PULLDOWN
Mcu.Pin22=PC9
PB5.Signal=SPI3_MOSI
Mcu.Pin23=PA9
RCC.TimSysFreq_Value=72000000
Mcu.Pin20=PC7
PE13.GPIO_Label=BLE_LINKS_WAKE_HW
Mcu.Pin21=PC8
PD10.Locked=true
PA5.GPIO_Label=SD_SCK
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
OSC_IN.Mode=HSE-External-Oscillator
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE5.GPIO_Label=BUZZER
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PB9.PinState=GPIO_PIN_SET
PD1.PinState=GPIO_PIN_SET
PA11.Signal=CAN1_RX
ProjectManager.HeapSize=0x200
Mcu.Pin15=PE13
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PE15
Mcu.Pin13=PE9
PD0.GPIO_PuPd=GPIO_PULLDOWN
Mcu.Pin14=PE11
Mcu.Pin19=PD13
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB15
Mcu.Pin18=PD10
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA6
Mcu.Pin12=PA7
PD0.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin10=PA5
PE2.Locked=true
PE4.PinState=GPIO_PIN_SET
PD2.Signal=UART5_RX
PD1.Locked=true
RCC.PLL2VCOoutputFreqValue=128000000
PA7.GPIOParameters=GPIO_Label
PC1.Signal=GPIO_Output
PD7.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
PE15.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
NVIC.CAN1_RX0_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.Prediv2FreqValue=8000000
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=72000000
PA6.Mode=Full_Duplex_Master
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F107VCTx
CAN1.AWUM=ENABLE
PE11.GPIO_Label=DISPLAY_ENABLE
PC10.Signal=UART4_TX
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART1_UART_Init-USART1-false-HAL-true,4-MX_SPI1_Init-SPI1-false-HAL-true,5-MX_UART5_Init-UART5-false-HAL-true,6-MX_CAN1_Init-CAN1-false-HAL-true,7-MX_UART4_Init-UART4-false-HAL-true,8-MX_USART2_UART_Init-USART2-false-HAL-true,9-MX_TIM1_Init-TIM1-false-HAL-true,10-MX_TIM2_Init-TIM2-false-HAL-true,11-MX_SPI3_Init-SPI3-false-HAL-true,12-MX_FATFS_Init-FATFS-false-HAL-false,13-MX_TIM6_Init-TIM6-false-HAL-true
PD0.GPIO_Label=LED_R0
PA11.Mode=CAN_Activate
PC9.Locked=true
RCC.ADCFreqValue=36000000
PD6.Locked=true
NVIC.TIM1_UP_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PC1.Locked=true
PB15.Signal=GPIO_Output
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x400
PC8.PinState=GPIO_PIN_SET
NVIC.UART5_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PD13.Signal=GPIO_Input
Mcu.IP4=SPI1
RCC.FCLKCortexFreq_Value=72000000
Mcu.IP5=SPI3
Mcu.IP2=NVIC
PD13.Locked=true
Mcu.IP3=RCC
PA15.GPIO_Label=LED_R1
Mcu.IP0=CAN1
Mcu.IP1=FATFS
PA12.Signal=CAN1_TX
PE4.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
TIM1.Prescaler=800
SPI1.CLKPolarity=SPI_POLARITY_HIGH
Mcu.UserConstants=
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
UART4.BaudRate=9600
RCC.HCLKFreq_Value=72000000
Mcu.IPNb=14
ProjectManager.PreviousToolchain=STM32CubeIDE
Mcu.Pin6=OSC_OUT
Mcu.Pin7=PC1
Mcu.Pin8=PA2
Mcu.Pin9=PA3
OSC_OUT.Mode=HSE-External-Oscillator
NVIC.CAN1_SCE_IRQn=true\:0\:0\:false\:false\:true\:true\:true
OSC_OUT.Signal=RCC_OSC_OUT
RCC.AHBFreq_Value=72000000
Mcu.Pin0=PE2
Mcu.Pin1=PE4
Mcu.Pin2=PE5
Mcu.Pin3=PC14-OSC32_IN
Mcu.Pin4=PC15-OSC32_OUT
PD10.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
Mcu.Pin5=OSC_IN
RCC.PLL3CLKoutputFreqValue=64000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP10=UART4
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USART1
RCC.PLLMUL=RCC_PLL_MUL9
Mcu.IP11=UART5
PB4.Mode=Full_Duplex_Master
Mcu.IP13=USART2
PE13.Signal=GPIO_Output
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PD0.PinState=GPIO_PIN_SET
PA14.Mode=Serial_Wire
PB5.Mode=Full_Duplex_Master
File.Version=6
PC7.PinState=GPIO_PIN_SET
PB8.Locked=true
PE4.Signal=GPIO_Output
ProjectManager.ProjectName=VektorControlUnit_V2
PD7.GPIO_Label=LED_B0
PD13.GPIO_Label=SD_DETECT
PA6.Signal=SPI1_MISO
VP_FATFS_VS_Generic.Signal=FATFS_VS_Generic
USART2.VirtualMode=VM_ASYNC
PD5.GPIO_Label=LED_G2
ProjectManager.ToolChainLocation=
PA15.Signal=GPIO_Output
RCC.PLL2CLKoutputFreqValue=64000000
UART5.IPParameters=VirtualMode,BaudRate
PE0.GPIO_Label=EEPROM_HOLD
PB9.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PD3.GPIO_Label=BLE_LINKS_ENABLE
PD6.Signal=GPIO_Output
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
PE2.GPIO_Label=LED_R3
PB15.Locked=true
PB4.Signal=SPI3_MISO
PA3.Signal=USART2_RX
PA2.Locked=true
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
PB8.GPIOParameters=PinState,GPIO_Label
PA7.Mode=Full_Duplex_Master
UART4.IPParameters=VirtualMode,BaudRate
PB9.GPIO_Label=EEPROM_CS
PA10.Mode=Asynchronous
PC9.GPIO_Label=LED_G3
ProjectManager.NoMain=false
PE2.PinState=GPIO_PIN_SET
SPI1.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,CLKPhase,CLKPolarity
PC11.Signal=UART4_RX
PC8.Signal=GPIO_Output
PC10.Mode=Asynchronous
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
ProjectManager.DefaultFWLocation=true
PD5.Signal=GPIO_Output
ProjectManager.DeletePrevious=true
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.FamilyName=M
PE9.GPIOParameters=GPIO_Label
PE15.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PB9.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PC8.GPIO_Label=LED_G0
FATFS.IPParameters=_USE_LFN,_MAX_SS
PA13.Signal=SYS_JTMS-SWDIO
PD4.GPIO_PuPd=GPIO_PULLDOWN
PA9.Mode=Asynchronous
PE0.PinState=GPIO_PIN_SET
PE15.GPIO_Label=FET1_CNTRL
CAN1.BS2=CAN_BS2_1TQ
CAN1.BS1=CAN_BS1_7TQ
ProjectManager.TargetToolchain=STM32CubeIDE
PE4.Locked=true
PE2.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
ProjectManager.RegisterCallBack=
PE0.Locked=true
RCC.USBFreq_Value=48000000
PD10.GPIO_Label=LED_B2
PE11.Signal=GPIO_Output
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
VP_FATFS_VS_Generic.Mode=User_defined
PD2.Mode=Asynchronous
board=custom
RCC.VCOOutput2Freq_Value=8000000
PA15.PinState=GPIO_PIN_SET
RCC.APB2Freq_Value=72000000
SPI3.CalculateBaudRate=9.0 MBits/s
MxCube.Version=6.2.1
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PD4.GPIO_Label=LED_B1
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
PC1.GPIO_Label=BLE_LINKS_WAKE_SW
PD4.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
PD13.GPIO_PuPd=GPIO_NOPULL
PD5.GPIO_PuPd=GPIO_PULLDOWN
PE5.Locked=true
PD5.PinState=GPIO_PIN_SET
PB15.GPIOParameters=GPIO_Label
RCC.IPParameters=ADCFreqValue,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,I2S2Freq_Value,I2S3Freq_Value,MCOFreq_Value,PLL2CLKoutputFreqValue,PLL2VCOoutputFreqValue,PLL3CLKoutputFreqValue,PLL3VCOoutputFreqValue,PLLCLKFreq_Value,PLLMUL,PLLSourceVirtual,Prediv2FreqValue,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F107V(B-C)Tx
PE0.Signal=GPIO_Output
PA2.Signal=USART2_TX
FATFS._MAX_SS=512
Mcu.IP8=TIM2
Mcu.IP9=TIM6
Mcu.IP6=SYS
Mcu.IP7=TIM1
ProjectManager.CoupleFile=false
PB3.Signal=SPI3_SCK
RCC.SYSCLKFreq_VALUE=72000000
PA7.GPIO_Label=SD_MOSI
PA12.Mode=CAN_Activate
KeepUserPlacement=false
PA14.Signal=SYS_JTCK-SWCLK
PE15.GPIO_PuPd=GPIO_PULLDOWN
PD10.PinState=GPIO_PIN_SET
PA15.GPIO_PuPd=GPIO_PULLDOWN
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Output
PC8.Locked=true
PC9.Signal=GPIO_Output
RCC.APB1Freq_Value=36000000
PE15.PinState=GPIO_PIN_RESET
ProjectManager.DeviceId=STM32F107VCTx
ProjectManager.LibraryCopy=1
PA7.Signal=SPI1_MOSI
isbadioc=false
